//
//  NewsController.swift
//  ViTruVK
//
//  Created by Вадим Терехов on 27.02.2021.
//

import UIKit

class NewsController: UIViewController {
    
    let news0001 = News(userPosted: id0001, text: """
    Власти Северной Кореи требуют немедленного возврата дрезины, которую угнал российский дипломат.
    Агентство ЦТАК опубликовало ноту МИД КНДР с требованием вернуть несамоходную дрезину, на которой 25 февраля вернулись в Россию сотрудники российского посольства и члены их семей. Как утверждает МИД, дипломаты завладели дрезиной незаконно.
    
    Российские СМИ сообщали, что дрезину изготовил третий секретарь посольства в КНДР Владислав Сорокин. Он был вынужден это сделать, поскольку все виды транспортного сообщения между Россией и Северной Кореей закрыты из-за пандемии. Преодолеть трёхкилометровую нейтральную полосу между пограничными станциями Туманган и Хасан можно только пешком по рельсам, что затруднительно сделать с детьми и вещами. По сведениям же корейских властей, он взял дрезину напрокат и не вернул.
    """, photo: "news0001", like: true)
    
    let news0002 = News(userPosted: id0007, text: """
    Посольство России в Непале сообщило об освобождении из секретной военной лаборатории 53-летнего Игоря Конюхова – исследователя Гималаев и троюродного брата знаменитого путешественника Фёдора Конюхова. В 2018 году непальские лесники приняли его за снежного человека и несколько лет изучали в секретной лаборатории.
    
    О том, что в Непале тайно содержится в неволе российский гражданин, стало известно после того, как группа непальских учёных опубликовала статью в журнале «Современная уфология», в которой описала ранее неизвестное науке существо, пойманное лесниками в предгорьях Гималаев. Существо имело рост более 2 метров, длинную косматую бороду и густой шерстяной покров. Одето оно было в тёплый вязаный свитер и грубые войлочные штаны и говорило на неизвестном непальцам языке.
    
    Статья случайно попалась на глаза российским специалистам, которые узнали среди слов этого языка, ошибочно принятого непальскими коллегами за диалект древних кроманьонцев, русские матерные выражения. После официального запроса МИД Конюхов был освобождён, а власти Непала принесли ему официальные извинения. В настоящее время исследователь вернулся к работе и отправился в Гималаи, отказавшись от возвращения в Россию.
    
    «Мы думали, что совершаем прорыв в культурологии. Снежный, как мы думали, человек был носителем удивительной и незнакомой нам культуры. Он умел играть на гитаре и пел очень душевные песни. Слов мы не понимали, но, когда показали их российским коллегам, они сказали, что это знаменитые хиты мэтра российской эстрады Юрия Лозы. Нам очень жаль, что мы помешали работе учёного. В следующий раз, поймав снежного человека, мы обязательно покажем его сначала представителям российского посольства», - сказал глава МИД Непала Прадил Кумар Гьявали.
    
    """, photo: "news0002", like: true)
    
    var newsArr = [news0001, news0002]

    
    @IBOutlet weak var newsTable: UITableView!
    
    let newsCellIdentifier = "newsXibCell"
    
    override func viewDidLoad() {
        super.viewDidLoad()
        
        newsTable.delegate = self
        newsTable.dataSource = self
        
        newsTable.register(UINib(nibName: "NewsCell", bundle: nil), forCellReuseIdentifier: newsCellIdentifier)
    }

}

extension NewsController: UITableViewDelegate, UITableViewDataSource {

    func numberOfSections(in tableView: UITableView) -> Int {
        return 1
    }

    func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return newsArr.count
    }

    func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        guard let cell = tableView.dequeueReusableCell(withIdentifier: newsCellIdentifier, for: indexPath) as? NewsCell else {
            return UITableViewCell()
        }

        cell.setNews(news: newsArr[indexPath.row])
        return cell

    }
}
